function [E_t] = OE_scl_ptb(E_0, t)
% 计算轨道根数随时间的变化，考虑J2摄动对平均摄动影响，输入E_0为初始轨道根数和递推时间t，输出为最终轨道根数E_t
% 该函数短期计算与赛题要求不完全一致，不建议采用其计算
    % 导入全局变量，保持参数一致性
    global J_2 R_E R_E_m w_E mu
    
    a0 = E_0(1); e0 = E_0(2); i0 = E_0(3); Omega0 = E_0(4); omega0 = E_0(5); M0 = E_0(6);
    % J_2 = 1.082627e-3;
    % R_E = 6378.137;
    % mu = 398600.4418;
    C_J2 = 1.5*J_2*R_E^2*sqrt(mu)*a0^(-3.5); % 中间系数，方便后续计算
    
    % 注意，该公式只是把J2引起的升交点赤经的周期性摄动平均化看待，然后线性计算升交点赤经的变化量，以此来近似得到升交点赤经
    % 该公式似乎缺少了对地球自转w_E的考虑
    Omega_t = Omega0 - C_J2*cos(i0)/(1-e0^2)^2*t; % 近似计算升交点赤经变化后值，适用于长期变化计算，但该值对于短期变化来说并不准确，升交点赤经并不是线性的
    % 注意，该公式也只是把J2引起的近地点角距的周期性摄动平均化看待，然后线性计算升交点赤经的变化量，以此来近似得到升交点赤经
    omega_t = omega0 + C_J2*(2-2.5*sin(i0)^2)/(1-e0^2)^2*t; % 近似计算近地点角距变化后值，适用于长期变化计算，但该值对于短期变化来说并不准确，近地点角距并不是线性的
    % 考虑J2摄动的平近点角变化，该公式可能也存在类似问题，暂未拿具体公式验证
    M_t = M0 + sqrt(mu/a0^3)*(1+0.5*C_J2*(1-e0^2)^(-1.5)*(3*cos(i0)^2-1))*t; % 平近点角变化
    E_t = [a0, e0, i0, Omega_t, omega_t, M_t];
end